load-testing/FK-API-test/100-75-10-report/statistics.json
{
  "GET Cart" : {
    "transaction" : "GET Cart",
    "sampleCount" : 1000,
    "errorCount" : 18,
    "errorPct" : 1.8,
    "meanResTime" : 197.29500000000013,
    "medianResTime" : 75.0,
    "minResTime" : 0.0,
    "maxResTime" : 15060.0,
    "pct1ResTime" : 593.0,
    "pct2ResTime" : 691.8999999999999,
    "pct3ResTime" : 929.3100000000006,
    "throughput" : 3.8777726074143013,
    "receivedKBytesPerSec" : 2.8504317354486584,
    "sentKBytesPerSec" : 0.7105715352101752
  },
  "POST Create Cart" : {
    "transaction" : "POST Create Cart",
    "sampleCount" : 100,
    "errorCount" : 1,
    "errorPct" : 1.0,
    "meanResTime" : 100.57000000000001,
    "medianResTime" : 56.0,
    "minResTime" : 20.0,
    "maxResTime" : 2149.0,
    "pct1ResTime" : 93.30000000000004,
    "pct2ResTime" : 324.49999999999807,
    "pct3ResTime" : 2140.999999999996,
    "throughput" : 1.3407701383674784,
    "receivedKBytesPerSec" : 0.4048366397283599,
    "sentKBytesPerSec" : 0.3548327221656119
  },
  "PUT Update Quantity" : {
    "transaction" : "PUT Update Quantity",
    "sampleCount" : 983,
    "errorCount" : 5,
    "errorPct" : 0.508647,
    "meanResTime" : 9162.12309257377,
    "medianResTime" : 7817.0,
    "minResTime" : 107.0,
    "maxResTime" : 25582.0,
    "pct1ResTime" : 21591.4,
    "pct2ResTime" : 23760.8,
    "pct3ResTime" : 24964.16,
    "throughput" : 3.7826605610497555,
    "receivedKBytesPerSec" : 0.36996412869896483,
    "sentKBytesPerSec" : 0.875479055633586
  },
  "POST Add Item" : {
    "transaction" : "POST Add Item",
    "sampleCount" : 1000,
    "errorCount" : 17,
    "errorPct" : 1.7,
    "meanResTime" : 216.5419999999999,
    "medianResTime" : 147.0,
    "minResTime" : 0.0,
    "maxResTime" : 15061.0,
    "pct1ResTime" : 248.0,
    "pct2ResTime" : 333.94999999999993,
    "pct3ResTime" : 1613.5800000000004,
    "throughput" : 3.8756685528253625,
    "receivedKBytesPerSec" : 1.1798647815576313,
    "sentKBytesPerSec" : 1.44440565411596
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4266,
    "errorCount" : 55,
    "errorPct" : 1.289264,
    "meanResTime" : 4447.684716361935,
    "medianResTime" : 627.5,
    "minResTime" : 0.0,
    "maxResTime" : 26125.0,
    "pct1ResTime" : 10134.60000000005,
    "pct2ResTime" : 21279.499999999996,
    "pct3ResTime" : 24879.89,
    "throughput" : 16.27772096643722,
    "receivedKBytesPerSec" : 4.969347363694119,
    "sentKBytesPerSec" : 4.101848676528945
  },
  "DELETE Cart (purchase)" : {
    "transaction" : "DELETE Cart (purchase)",
    "sampleCount" : 100,
    "errorCount" : 1,
    "errorPct" : 1.0,
    "meanResTime" : 5438.950000000002,
    "medianResTime" : 4563.5,
    "minResTime" : 4.0,
    "maxResTime" : 25155.0,
    "pct1ResTime" : 8614.500000000002,
    "pct2ResTime" : 16161.899999999918,
    "pct3ResTime" : 25153.29,
    "throughput" : 0.40966145577294927,
    "receivedKBytesPerSec" : 0.040166025546488376,
    "sentKBytesPerSec" : 0.08386858162914167
  },
  "POST Add Item (seed)" : {
    "transaction" : "POST Add Item (seed)",
    "sampleCount" : 100,
    "errorCount" : 2,
    "errorPct" : 2.0,
    "meanResTime" : 184.38999999999996,
    "medianResTime" : 156.5,
    "minResTime" : 1.0,
    "maxResTime" : 1487.0,
    "pct1ResTime" : 237.50000000000003,
    "pct2ResTime" : 340.79999999999995,
    "pct3ResTime" : 1479.6099999999963,
    "throughput" : 1.316083860863614,
    "receivedKBytesPerSec" : 0.3999404060776752,
    "sentKBytesPerSec" : 0.49048543341931744
  },
  "DELETE Remove Item" : {
    "transaction" : "DELETE Remove Item",
    "sampleCount" : 983,
    "errorCount" : 11,
    "errorPct" : 1.1190234,
    "meanResTime" : 9136.549338758907,
    "medianResTime" : 7902.0,
    "minResTime" : 96.0,
    "maxResTime" : 26125.0,
    "pct1ResTime" : 21947.8,
    "pct2ResTime" : 24099.799999999996,
    "pct3ResTime" : 25516.199999999997,
    "throughput" : 3.7659949429162514,
    "receivedKBytesPerSec" : 0.36900758323117006,
    "sentKBytesPerSec" : 0.7943895582713969
  }
}