load-testing/FK-API-test/200-100-10-report/statistics.json
{
  "GET Cart" : {
    "transaction" : "GET Cart",
    "sampleCount" : 2000,
    "errorCount" : 53,
    "errorPct" : 2.65,
    "meanResTime" : 6602.429999999989,
    "medianResTime" : 6550.5,
    "minResTime" : 0.0,
    "maxResTime" : 30328.0,
    "pct1ResTime" : 9447.0,
    "pct2ResTime" : 10646.349999999991,
    "pct3ResTime" : 30024.0,
    "throughput" : 3.3339223262776425,
    "receivedKBytesPerSec" : 2.4588377149754788,
    "sentKBytesPerSec" : 0.6109152200222039
  },
  "POST Create Cart" : {
    "transaction" : "POST Create Cart",
    "sampleCount" : 200,
    "errorCount" : 2,
    "errorPct" : 1.0,
    "meanResTime" : 3822.984999999999,
    "medianResTime" : 2715.5,
    "minResTime" : 75.0,
    "maxResTime" : 30845.0,
    "pct1ResTime" : 7142.5,
    "pct2ResTime" : 8668.199999999995,
    "pct3ResTime" : 30118.880000000016,
    "throughput" : 1.5745056052399546,
    "receivedKBytesPerSec" : 0.4754115118009195,
    "sentKBytesPerSec" : 0.4166904482617458
  },
  "PUT Update Quantity" : {
    "transaction" : "PUT Update Quantity",
    "sampleCount" : 1948,
    "errorCount" : 34,
    "errorPct" : 1.7453799,
    "meanResTime" : 18096.94404517452,
    "medianResTime" : 18851.5,
    "minResTime" : 138.0,
    "maxResTime" : 41342.0,
    "pct1ResTime" : 22591.0,
    "pct2ResTime" : 24248.6,
    "pct3ResTime" : 30218.48,
    "throughput" : 3.2435366537957537,
    "receivedKBytesPerSec" : 0.3184101820909489,
    "sentKBytesPerSec" : 0.7507013544429626
  },
  "POST Add Item" : {
    "transaction" : "POST Add Item",
    "sampleCount" : 2000,
    "errorCount" : 52,
    "errorPct" : 2.6,
    "meanResTime" : 6365.205000000004,
    "medianResTime" : 6296.0,
    "minResTime" : 0.0,
    "maxResTime" : 30249.0,
    "pct1ResTime" : 9312.300000000001,
    "pct2ResTime" : 10057.599999999995,
    "pct3ResTime" : 30016.99,
    "throughput" : 3.331933921086477,
    "receivedKBytesPerSec" : 1.008918702061801,
    "sentKBytesPerSec" : 1.2417636155314768
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 8496,
    "errorCount" : 183,
    "errorPct" : 2.1539547,
    "meanResTime" : 11862.072504708116,
    "medianResTime" : 9086.0,
    "minResTime" : 0.0,
    "maxResTime" : 41342.0,
    "pct1ResTime" : 21629.0,
    "pct2ResTime" : 22878.899999999998,
    "pct3ResTime" : 30031.03,
    "throughput" : 13.65521231797872,
    "receivedKBytesPerSec" : 4.18519139607911,
    "sentKBytesPerSec" : 3.4427807015252823
  },
  "DELETE Cart (purchase)" : {
    "transaction" : "DELETE Cart (purchase)",
    "sampleCount" : 200,
    "errorCount" : 5,
    "errorPct" : 2.5,
    "meanResTime" : 12519.244999999997,
    "medianResTime" : 13060.0,
    "minResTime" : 0.0,
    "maxResTime" : 35503.0,
    "pct1ResTime" : 18888.9,
    "pct2ResTime" : 24254.549999999974,
    "pct3ResTime" : 30870.670000000002,
    "throughput" : 0.3630231844756765,
    "receivedKBytesPerSec" : 0.035752820463253884,
    "sentKBytesPerSec" : 0.07432048866550862
  },
  "POST Add Item (seed)" : {
    "transaction" : "POST Add Item (seed)",
    "sampleCount" : 200,
    "errorCount" : 4,
    "errorPct" : 2.0,
    "meanResTime" : 3682.3450000000007,
    "medianResTime" : 2883.0,
    "minResTime" : 3.0,
    "maxResTime" : 32890.0,
    "pct1ResTime" : 7456.900000000001,
    "pct2ResTime" : 8128.95,
    "pct3ResTime" : 30021.42000000007,
    "throughput" : 1.4778033930365904,
    "receivedKBytesPerSec" : 0.449084824067506,
    "sentKBytesPerSec" : 0.5507559657075722
  },
  "DELETE Remove Item" : {
    "transaction" : "DELETE Remove Item",
    "sampleCount" : 1948,
    "errorCount" : 33,
    "errorPct" : 1.6940452,
    "meanResTime" : 18268.550308008205,
    "medianResTime" : 18918.0,
    "minResTime" : 150.0,
    "maxResTime" : 40210.0,
    "pct1ResTime" : 22658.9,
    "pct2ResTime" : 24281.3,
    "pct3ResTime" : 30055.59,
    "throughput" : 3.1545639155457814,
    "receivedKBytesPerSec" : 0.3096284996955554,
    "sentKBytesPerSec" : 0.6654158259354382
  }
}