load-testing/FK-API-test/50-30-10-report/statistics.json
{
  "GET Cart" : {
    "transaction" : "GET Cart",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 77.18999999999998,
    "medianResTime" : 70.0,
    "minResTime" : 33.0,
    "maxResTime" : 1003.0,
    "pct1ResTime" : 91.0,
    "pct2ResTime" : 100.94999999999999,
    "pct3ResTime" : 233.96000000000004,
    "throughput" : 4.699203954850049,
    "receivedKBytesPerSec" : 3.426151055323728,
    "sentKBytesPerSec" : 0.8627444760857511
  },
  "POST Create Cart" : {
    "transaction" : "POST Create Cart",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 68.50000000000001,
    "medianResTime" : 45.0,
    "minResTime" : 19.0,
    "maxResTime" : 634.0,
    "pct1ResTime" : 93.59999999999998,
    "pct2ResTime" : 257.29999999999865,
    "pct3ResTime" : 634.0,
    "throughput" : 1.699350847976073,
    "receivedKBytesPerSec" : 0.5161114391802332,
    "sentKBytesPerSec" : 0.4497305466811678
  },
  "PUT Update Quantity" : {
    "transaction" : "PUT Update Quantity",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3879.99,
    "medianResTime" : 4202.5,
    "minResTime" : 151.0,
    "maxResTime" : 6036.0,
    "pct1ResTime" : 5257.500000000001,
    "pct2ResTime" : 5410.9,
    "pct3ResTime" : 5921.87,
    "throughput" : 4.643775947098104,
    "receivedKBytesPerSec" : 0.45349374483379923,
    "sentKBytesPerSec" : 1.0747801752561041
  },
  "POST Add Item" : {
    "transaction" : "POST Add Item",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 169.4800000000001,
    "medianResTime" : 146.5,
    "minResTime" : 80.0,
    "maxResTime" : 1040.0,
    "pct1ResTime" : 226.90000000000003,
    "pct2ResTime" : 298.5499999999999,
    "pct3ResTime" : 658.4700000000005,
    "throughput" : 4.696070328349237,
    "receivedKBytesPerSec" : 1.444591946708994,
    "sentKBytesPerSec" : 1.751854360770907
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1930.7293023255813,
    "medianResTime" : 300.0,
    "minResTime" : 19.0,
    "maxResTime" : 6036.0,
    "pct1ResTime" : 4873.8,
    "pct2ResTime" : 5184.0,
    "pct3ResTime" : 5739.329999999996,
    "throughput" : 19.61303035002417,
    "receivedKBytesPerSec" : 5.942839063112907,
    "sentKBytesPerSec" : 4.941118860665384
  },
  "DELETE Cart (purchase)" : {
    "transaction" : "DELETE Cart (purchase)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2589.000000000001,
    "medianResTime" : 2455.5,
    "minResTime" : 389.0,
    "maxResTime" : 5617.0,
    "pct1ResTime" : 4693.6,
    "pct2ResTime" : 4852.849999999999,
    "pct3ResTime" : 5617.0,
    "throughput" : 0.7819586500265866,
    "receivedKBytesPerSec" : 0.07636314941665885,
    "sentKBytesPerSec" : 0.1603626137749836
  },
  "POST Add Item (seed)" : {
    "transaction" : "POST Add Item (seed)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 185.64,
    "medianResTime" : 161.5,
    "minResTime" : 91.0,
    "maxResTime" : 913.0,
    "pct1ResTime" : 270.59999999999997,
    "pct2ResTime" : 385.24999999999903,
    "pct3ResTime" : 913.0,
    "throughput" : 1.6998130205677375,
    "receivedKBytesPerSec" : 0.5228917006629271,
    "sentKBytesPerSec" : 0.6341099354071053
  },
  "DELETE Remove Item" : {
    "transaction" : "DELETE Remove Item",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3891.162000000001,
    "medianResTime" : 4176.0,
    "minResTime" : 149.0,
    "maxResTime" : 6000.0,
    "pct1ResTime" : 5202.6,
    "pct2ResTime" : 5428.25,
    "pct3ResTime" : 5890.780000000001,
    "throughput" : 4.643819076808767,
    "receivedKBytesPerSec" : 0.4534979567196062,
    "sentKBytesPerSec" : 0.9795555865143494
  }
}